# IdeaStatiCa.ConnectionApi.Model.ConAddedMemberPositioning

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**PositioningType** | **ConAddedMemberPositioningEnum** |  | [optional]
**AngleAlpha** | **double** |  | [optional]
**AngleBeta** | **double** |  | [optional]
**RotationRx** | **double** |  | [optional]
**InsertPoint** | **Point3D** |  | [optional]
**Eccentricity** | **Vector3D** |  | [optional]
**PlacementDefinition** | **ConStiffeningMemberPlacement** |  | [optional]
**AxisX** | **Vector3D** |  | [optional]
**AxisY** | **Vector3D** |  | [optional]
**AxisZ** | **Vector3D** |  | [optional]
**OnMemberId** | **int?** |  | [optional]
**OnPlateIndex** | **int?** |  | [optional]
**OnPlateOperationId** | **int?** |  | [optional]
**OnMemberPlateIndex** | **int** |  | [optional]
**AddedMemberPlateIndex** | **int** |  | [optional]
**MountType** | **ConPlateFunction** |  | [optional]
**MountLocation** | **ConLocation** |  | [optional]
**PlateEdgeIndex** | **int** |  | [optional]
**PositionX** | **double** |  | [optional]
**PositionY** | **double** |  | [optional]
**Rotation** | **double** |  | [optional]
**Pitch** | **double** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)